non-sarif-metadata/README.org
# -*- coding: utf-8 -*-
# Created [Thu Apr 14 10:16:37 2022]
#+TITLE: 
#+AUTHOR: Michael Hohn
#+LANGUAGE:  en
#+TEXT:      
#+OPTIONS: ^:{} H:2 num:t \n:nil @:t ::t |:t ^:nil f:t *:t TeX:t LaTeX:t skip:nil p:nil
#+OPTIONS: toc:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./l3style.css"/>
#+HTML: <div id="toc">
#+TOC: headlines 2        insert TOC here, with two headline levels
#+HTML: </div> 
# 
#+HTML: <div id="org-content">

* Overview
  There may be metrics and other meta-information of interest that are not
  provided by the default queries.  Additional project-related information is
  available through the github API, and almost any meta-information can be
  collected by the build process at build time.

  In addition to these two additional source of information, there are several
  CodeQL queries and classes that provide additional meta-information.  These are
  summarized in the rest of this document.

  Short samples for the github API are found in
  [[../notes/gathering-api-information.org]] and those are used in
  [[../notes/tables.org]], "New tables to be exported".

* Code scanning @metric and @diagnostic queries
  The CodeQL library contains many =@kinds= of query in addition to problem and
  path-problem:
  #+BEGIN_SRC sh
    hohn@gh-hohn ~/local/codeql-v2.8.4/ql/cpp/ql/src
    0:$ ag '@kind' |sed 's/^.*@//g;' | sort -u
    kind alert-suppression
    kind chart
    kind definitions
    kind diagnostic
    kind display-string
    kind extent
    kind file-classifier
    kind graph
    kind metric
    kind path-problem
    kind problem
    kind source-link
    kind table
    kind tree
    kind treemap
  #+END_SRC

  The queries of =@kind= diagnostic and metric contains those; some more
  statistics are found under =@kind= table and treemap.

* Project & codeql db build
  For testing, we build a mid-size C project that builds on multiple architectures
  and for which alerts are found.  A =.zip= file of the resulting database is in
  [[./pure-ftpd-4f26ce6.db.zip]]

  #+BEGIN_SRC sh
    # Get
    cd ~/local/sarif-cli/non-sarif-metadata 
    git clone https://github.com/jedisct1/pure-ftpd.git

    # Configure
    cd ~/local/sarif-cli/non-sarif-metadata/pure-ftpd
    ./autogen.sh 
    ./configure

    # Build
    cd ~/local/sarif-cli/non-sarif-metadata/pure-ftpd

    # Build db
    cd ~/local/sarif-cli/non-sarif-metadata/pure-ftpd
    export PATH=$HOME/local/codeql-v2.8.4/codeql:"$PATH"
    codeql --version
    codeql resolve qlpacks

    GITREV=$(git rev-parse --short HEAD)
    codeql database create --language=cpp -s . -vvvv pure-ftpd-$GITREV.db \
           --command='make -j8' 

    # Logs
    ls pure-ftpd-$GITREV.db/log
    : build-tracer.log  database-create-20220422.121448.872.log
  #+END_SRC

* Existing queries producing diagnostic info
  Some existing queries from the standard library and their =@kinds= are
  - @id cpp/diagnostics/successfully-extracted-files (@kind diagnostic)
  - @id cpp/diagnostics/extraction-warnings (@kind diagnostic)
  - @id cpp/architecture/general-statistics (@kind table)
  - @id cpp/external-dependencies (@kind treemap)
  - @id cpp/summary/lines-of-code (@kind metric)
  - @id cpp/summary/lines-of-user-code (@kind metric)

  The next sections run them and show samples of their output.
  
