non-sarif-metadata/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-28 Thu 16:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Michael Hohn" />
<link rel="stylesheet" type="text/css" href="./l3style.css"/>
</head>
<body>
<div id="content">
<div id="toc">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8d07361">1. Overview</a></li>
<li><a href="#org821d058">2. Code scanning @metric and @diagnostic queries</a></li>
<li><a href="#org2d92388">3. Project &amp; codeql db build</a></li>
<li><a href="#org08b2df4">4. Existing queries producing diagnostic info</a>
<ul>
<li><a href="#org8ff677a">4.1. Metric and Diagnostic queries</a></li>
<li><a href="#org51382e8">4.2. Table queries</a></li>
<li><a href="#orgd05c2f8">4.3. Treemap queries</a></li>
<li><a href="#org59c972a">4.4. Custom queries</a></li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="org-content">

<div id="outline-container-org8d07361" class="outline-2">
<h2 id="org8d07361"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
There may be metrics and other meta-information of interest that are not
provided by the default queries.  Additional project-related information is
available through the github API, and almost any meta-information can be
collected by the build process at build time.
</p>

<p>
In addition to these two additional source of information, there are several
CodeQL queries and classes that provide additional meta-information.  These are
summarized in the rest of this document.
</p>

<p>
Short samples for the github API are found in
<a href="../notes/gathering-api-information.html">../notes/gathering-api-information.html</a> and those are used in
<a href="../notes/tables.html">../notes/tables.html</a>, "New tables to be exported".
</p>
</div>
</div>

<div id="outline-container-org821d058" class="outline-2">
<h2 id="org821d058"><span class="section-number-2">2</span> Code scanning @metric and @diagnostic queries</h2>
<div class="outline-text-2" id="text-2">
<p>
The CodeQL library contains many <code>@kinds</code> of query in addition to problem and
path-problem:
</p>
<div class="org-src-container">
<pre class="src src-sh">hohn@gh-hohn ~/local/codeql-v2.8.4/ql/cpp/ql/src
0:$ ag <span style="color: #8b2252;">'@kind'</span> |sed <span style="color: #8b2252;">'s/^.*@//g;'</span> | sort -u
kind alert-suppression
kind chart
kind definitions
kind diagnostic
kind display-string
kind extent
kind file-classifier
kind graph
kind metric
kind path-problem
kind problem
kind source-link
kind table
kind tree
kind treemap
</pre>
</div>

<p>
The queries of <code>@kind</code> diagnostic and metric contains those; some more
statistics are found under <code>@kind</code> table and treemap.
</p>
</div>
</div>

<div id="outline-container-org2d92388" class="outline-2">
<h2 id="org2d92388"><span class="section-number-2">3</span> Project &amp; codeql db build</h2>
<div class="outline-text-2" id="text-3">
<p>
For testing, we build a mid-size C project that builds on multiple architectures
and for which alerts are found.  A <code>.zip</code> file of the resulting database is in
<a href="./pure-ftpd-4f26ce6.db.zip">./pure-ftpd-4f26ce6.db.zip</a>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Get</span>
<span style="color: #483d8b;">cd</span> ~/local/sarif-cli/non-sarif-metadata 
git clone https://github.com/jedisct1/pure-ftpd.git

<span style="color: #b22222;"># </span><span style="color: #b22222;">Configure</span>
<span style="color: #483d8b;">cd</span> ~/local/sarif-cli/non-sarif-metadata/pure-ftpd
./autogen.sh 
./configure

<span style="color: #b22222;"># </span><span style="color: #b22222;">Build</span>
<span style="color: #483d8b;">cd</span> ~/local/sarif-cli/non-sarif-metadata/pure-ftpd

<span style="color: #b22222;"># </span><span style="color: #b22222;">Build db</span>
<span style="color: #483d8b;">cd</span> ~/local/sarif-cli/non-sarif-metadata/pure-ftpd
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">PATH</span>=$<span style="color: #a0522d;">HOME</span>/local/codeql-v2.8.4/codeql:<span style="color: #8b2252;">"$PATH"</span>
codeql --version
codeql resolve qlpacks

<span style="color: #a0522d;">GITREV</span>=$(<span style="color: #ff00ff;">git</span> rev-parse --short HEAD)
codeql database create --language=cpp -s . -vvvv pure-ftpd-$<span style="color: #a0522d;">GITREV</span>.db <span style="color: #8b2252;">\</span>
       --command=<span style="color: #8b2252;">'make -j8'</span> 

<span style="color: #b22222;"># </span><span style="color: #b22222;">Logs</span>
ls pure-ftpd-$<span style="color: #a0522d;">GITREV</span>.db/log
: build-tracer.log  database-create-20220422.121448.872.log
</pre>
</div>
</div>
</div>

<div id="outline-container-org08b2df4" class="outline-2">
<h2 id="org08b2df4"><span class="section-number-2">4</span> Existing queries producing diagnostic info</h2>
<div class="outline-text-2" id="text-4">
<p>
Some existing queries from the standard library and their <code>@kinds</code> are
</p>
<ul class="org-ul">
<li>@id cpp/diagnostics/successfully-extracted-files (@kind diagnostic)</li>
<li>@id cpp/diagnostics/extraction-warnings (@kind diagnostic)</li>
<li>@id cpp/architecture/general-statistics (@kind table)</li>
<li>@id cpp/external-dependencies (@kind treemap)</li>
<li>@id cpp/summary/lines-of-code (@kind metric)</li>
<li>@id cpp/summary/lines-of-user-code (@kind metric)</li>
</ul>

<p>
The next sections run them and show samples of their output.
</p>
</div>
