non-sarif-metadata/README.org
** Metric and Diagnostic queries
   Not all =@kind= s support all output formats; for =@kind metric= and =@kind
   diagnostic= queries, only the =sarif= format produces output in the named files.

   To run all of those queries, use the query suite via
   #+BEGIN_SRC sh
     # Common variables
     export PATH=$HOME/local/codeql-v2.8.4/codeql:"$PATH"
     GITREV=$(cd ~/local/sarif-cli/non-sarif-metadata/pure-ftpd && git rev-parse --short HEAD)

     # Working directory
     cd ~/local/sarif-cli/non-sarif-metadata/

     # List the queries run
     codeql resolve queries diagnostic-and-metric.qls |sed 's|.*codeql-|codeql-|g;'

     # Run queries and collect output
     codeql database analyze --format=sarif-latest   \
            --output diagnostic-and-metric.sarif     \
            -j8                                      \
            --                                       \
            pure-ftpd/pure-ftpd-$GITREV.db           \
            diagnostic-and-metric.qls
   #+END_SRC

   Those queries enumerated:
   #+BEGIN_SRC text
     codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/ExtractionWarnings.ql
     codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/FailedExtractorInvocations.ql
     codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/SuccessfullyExtractedFiles.ql
     codeql-v2.8.4/ql/cpp/ql/src/Summary/LinesOfCode.ql
     codeql-v2.8.4/ql/cpp/ql/src/Summary/LinesOfUserCode.ql
   #+END_SRC

   Summaries of the results of running =diagnostic= and =metric= queries are part
   of the log output:

   /Analysis produced the following diagnostic data:/
   |          Diagnostic          |  Summary   |
   |------------------------------+------------+
   | Extraction warnings          | 0 results  |
   | Failed extractor invocations | 0 results  |
   | Successfully extracted files | 85 results |

   /Analysis produced the following metric data:/
   |                         Metric                         | Value |
   |--------------------------------------------------------+-------+
   | Total lines of C/C++ code in the database              | 45606 |
   | Total lines of user written C/C++ code in the database | 23932 |

   Entries in =diagnostic-and-metric.sarif= provide the details of non-zero
   summaries, so no entries for
   #+BEGIN_SRC text
     codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/ExtractionWarnings.ql
     codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/FailedExtractorInvocations.ql
   #+END_SRC

   Typical sarif entries -- but in different subtrees from =results= -- for
   =codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/SuccessfullyExtractedFiles.ql=
   #+BEGIN_SRC yaml
     $schema: https://json.schemastore.org/sarif-2.1.0.json
     runs:
     - artifacts:
       invocations:
       - executionSuccessful: true
         - descriptor:
             id: cpp/diagnostics/successfully-extracted-files
             index: 2
           level: none
           locations:
           - physicalLocation:
               artifactLocation:
                 index: 0
                 uri: config.h
                 uriBaseId: '%SRCROOT%'
           message:
             text: File successfully extracted
           properties:
             formattedMessage:
               text: File successfully extracted
             relatedLocations: []
         - ...
   #+END_SRC

   and =codeql-v2.8.4/ql/cpp/ql/src/Summary/LinesOfCode.ql=
   #+BEGIN_SRC yaml
     $schema: https://json.schemastore.org/sarif-2.1.0.json
     runs:
     - artifacts:
       properties:
         metricResults:
         - rule:
             id: cpp/summary/lines-of-code
             index: 0
           ruleId: cpp/summary/lines-of-code
           ruleIndex: 0
           value: 45606
   #+END_SRC

   and =codeql-v2.8.4/ql/cpp/ql/src/Summary/LinesOfUserCode.ql=
   #+BEGIN_SRC yaml
     $schema: https://json.schemastore.org/sarif-2.1.0.json
     runs:
     - artifacts:
       properties:
         metricResults:
         - baseline: 29497
           rule:
             id: cpp/summary/lines-of-user-code
             index: 1
           ruleId: cpp/summary/lines-of-user-code
           ruleIndex: 1
           value: 23932
   #+END_SRC

   In addition to =file.getMetrics()=, these libraries provide support:
   1. =codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/ExtractionProblems.qll= provides a
      common hierarchy of all types of problems that can occur during extraction.
      # ~/local/codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/ExtractionProblems.qll:

   2. =codeql-v2.8.4/ql/cpp/ql/lib/semmle/code/cpp/Compilation.qll= provides
      =class Compilation=, an invocation of the compiler.
      # file:~/local/codeql-v2.8.4/ql/cpp/ql/lib/semmle/code/cpp/Compilation.qll
   
