non-sarif-metadata/README.html

<div id="outline-container-org8ff677a" class="outline-3">
<h3 id="org8ff677a"><span class="section-number-3">4.1</span> Metric and Diagnostic queries</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Not all <code>@kind</code> s support all output formats; for <code>@kind metric</code> and <code>@kind
   diagnostic</code> queries, only the <code>sarif</code> format produces output in the named files.
</p>

<p>
To run all of those queries, use the query suite via
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Common variables</span>
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">PATH</span>=$<span style="color: #a0522d;">HOME</span>/local/codeql-v2.8.4/codeql:<span style="color: #8b2252;">"$PATH"</span>
<span style="color: #a0522d;">GITREV</span>=$(<span style="color: #ff00ff;">cd</span> ~/local/sarif-cli/non-sarif-metadata/pure-ftpd &amp;&amp; git rev-parse --short HEAD)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Working directory</span>
<span style="color: #483d8b;">cd</span> ~/local/sarif-cli/non-sarif-metadata/

<span style="color: #b22222;"># </span><span style="color: #b22222;">List the queries run</span>
codeql resolve queries diagnostic-and-metric.qls |sed <span style="color: #8b2252;">'s|.*codeql-|codeql-|g;'</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Run queries and collect output</span>
codeql database analyze --format=sarif-latest   <span style="color: #8b2252;">\</span>
       --output diagnostic-and-metric.sarif     <span style="color: #8b2252;">\</span>
       -j8                                      <span style="color: #8b2252;">\</span>
       --                                       <span style="color: #8b2252;">\</span>
       pure-ftpd/pure-ftpd-$<span style="color: #a0522d;">GITREV</span>.db           <span style="color: #8b2252;">\</span>
       diagnostic-and-metric.qls
</pre>
</div>

<p>
Those queries enumerated:
</p>
<div class="org-src-container">
<pre class="src src-text">codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/ExtractionWarnings.ql
codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/FailedExtractorInvocations.ql
codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/SuccessfullyExtractedFiles.ql
codeql-v2.8.4/ql/cpp/ql/src/Summary/LinesOfCode.ql
codeql-v2.8.4/ql/cpp/ql/src/Summary/LinesOfUserCode.ql
</pre>
</div>

<p>
Summaries of the results of running <code>diagnostic</code> and <code>metric</code> queries are part
of the log output:
</p>

<p>
<i>Analysis produced the following diagnostic data:</i>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Diagnostic</th>
<th scope="col" class="org-left">Summary</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Extraction warnings</td>
<td class="org-left">0 results</td>
</tr>

<tr>
<td class="org-left">Failed extractor invocations</td>
<td class="org-left">0 results</td>
</tr>

<tr>
<td class="org-left">Successfully extracted files</td>
<td class="org-left">85 results</td>
</tr>
</tbody>
</table>

<p>
<i>Analysis produced the following metric data:</i>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Metric</th>
<th scope="col" class="org-right">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Total lines of C/C++ code in the database</td>
<td class="org-right">45606</td>
</tr>

<tr>
<td class="org-left">Total lines of user written C/C++ code in the database</td>
<td class="org-right">23932</td>
</tr>
</tbody>
</table>

<p>
Entries in <code>diagnostic-and-metric.sarif</code> provide the details of non-zero
summaries, so no entries for
</p>
<div class="org-src-container">
<pre class="src src-text">codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/ExtractionWarnings.ql
codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/FailedExtractorInvocations.ql
</pre>
</div>

<p>
Typical sarif entries &#x2013; but in different subtrees from <code>results</code> &#x2013; for
<code>codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/SuccessfullyExtractedFiles.ql</code>
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #a0522d;">$schema</span>: https://json.schemastore.org/sarif-2.1.0.json
<span style="color: #a0522d;">runs</span>:
- <span style="color: #a0522d;">artifacts</span>:
  <span style="color: #a0522d;">invocations</span>:
  - <span style="color: #a0522d;">executionSuccessful</span>: <span style="color: #008b8b;">true</span>
    - <span style="color: #a0522d;">descriptor</span>:
        <span style="color: #a0522d;">id</span>: cpp/diagnostics/successfully-extracted-files
        <span style="color: #a0522d;">index</span>: 2
      <span style="color: #a0522d;">level</span>: none
      <span style="color: #a0522d;">locations</span>:
      - <span style="color: #a0522d;">physicalLocation</span>:
          <span style="color: #a0522d;">artifactLocation</span>:
            <span style="color: #a0522d;">index</span>: 0
            <span style="color: #a0522d;">uri</span>: config.h
            <span style="color: #a0522d;">uriBaseId</span>: <span style="color: #8b2252;">'%SRCROOT%'</span>
      <span style="color: #a0522d;">message</span>:
        <span style="color: #a0522d;">text</span>: File successfully extracted
      <span style="color: #a0522d;">properties</span>:
        <span style="color: #a0522d;">formattedMessage</span>:
          <span style="color: #a0522d;">text</span>: File successfully extracted
        <span style="color: #a0522d;">relatedLocations</span>: []
    - ...
</pre>
</div>

<p>
and <code>codeql-v2.8.4/ql/cpp/ql/src/Summary/LinesOfCode.ql</code>
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #a0522d;">$schema</span>: https://json.schemastore.org/sarif-2.1.0.json
<span style="color: #a0522d;">runs</span>:
- <span style="color: #a0522d;">artifacts</span>:
  <span style="color: #a0522d;">properties</span>:
    <span style="color: #a0522d;">metricResults</span>:
    - <span style="color: #a0522d;">rule</span>:
        <span style="color: #a0522d;">id</span>: cpp/summary/lines-of-code
        <span style="color: #a0522d;">index</span>: 0
      <span style="color: #a0522d;">ruleId</span>: cpp/summary/lines-of-code
      <span style="color: #a0522d;">ruleIndex</span>: 0
      <span style="color: #a0522d;">value</span>: 45606
</pre>
</div>

<p>
and <code>codeql-v2.8.4/ql/cpp/ql/src/Summary/LinesOfUserCode.ql</code>
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #a0522d;">$schema</span>: https://json.schemastore.org/sarif-2.1.0.json
<span style="color: #a0522d;">runs</span>:
- <span style="color: #a0522d;">artifacts</span>:
  <span style="color: #a0522d;">properties</span>:
    <span style="color: #a0522d;">metricResults</span>:
    - <span style="color: #a0522d;">baseline</span>: 29497
      <span style="color: #a0522d;">rule</span>:
        <span style="color: #a0522d;">id</span>: cpp/summary/lines-of-user-code
        <span style="color: #a0522d;">index</span>: 1
      <span style="color: #a0522d;">ruleId</span>: cpp/summary/lines-of-user-code
      <span style="color: #a0522d;">ruleIndex</span>: 1
      <span style="color: #a0522d;">value</span>: 23932
</pre>
</div>

<p>
In addition to <code>file.getMetrics()</code>, these libraries provide support:
</p>
<ol class="org-ol">
<li><code>codeql-v2.8.4/ql/cpp/ql/src/Diagnostics/ExtractionProblems.qll</code> provides a
common hierarchy of all types of problems that can occur during extraction.</li>

<li><code>codeql-v2.8.4/ql/cpp/ql/lib/semmle/code/cpp/Compilation.qll</code> provides
<code>class Compilation</code>, an invocation of the compiler.</li>
</ol>
</div>
</div>
