non-sarif-metadata/README.org
** Table queries
   Generating table output is more involved; the following produces CSV from all results.
   #+BEGIN_SRC sh
     # Common variables
     export PATH=$HOME/local/codeql-v2.8.4/codeql:"$PATH"
     GITREV=$(cd ~/local/sarif-cli/non-sarif-metadata/pure-ftpd && git rev-parse --short HEAD)

     # Working directory
     cd ~/local/sarif-cli/non-sarif-metadata/

     # Remove prior files
     find pure-ftpd -name "*.bqrs" -exec rm {} \; 

     # 
     # Run a query against the database, saving the results to the results/
     # subdirectory of the database directory for further processing.
     codeql database run-queries -j8 --ram=20000 -- \
            pure-ftpd/pure-ftpd-$GITREV.db  tables.qls

     find pure-ftpd -name "*.bqrs" > bqrs-files

     codeql resolve queries tables.qls  | \
         while read path ; do basename "$path" ; done > table-filenames

     # Get general info about available results
     cat bqrs-files | while read file 
     do
         codeql bqrs info --format=text -- "$file"
     done 

     # Format result as csv for processing
     codeql bqrs decode  --result-set="#select" \
            --format=csv \
            --entities=all -- "$file"

     # Format results as text for reading
     cat bqrs-files | while read file
     do
         echo "==> $file <=="
         codeql bqrs decode  --result-set="#select" \
                --format=text \
                --entities=all -- "$file" |\
             sed 's/\+--/|--/g;' | sed 's/--\+/--|/g;'
     done

   #+END_SRC

   Repository-level results:

   ==> /cpp-queries/Metrics/Internal/DiagnosticsSumElapsedTimes.bqrs <==
   | sum_frontend_elapsed_seconds | sum_extractor_elapsed_seconds |
   |------------------------------|-------------------------------|
   |                          6.0 |                           4.0 |

   ==> /cpp-queries/Architecture/General Top-Level Information/GeneralStatistics.bqrs <==
   |          Title          | Value |
   |-------------------------|-------|
   | Number of Files         | 363   |
   | Number of Unions        | 8     |
   | Number of C Files       | 53    |
   | Number of Structs       | 235   |
   | Number of Namespaces    | 1     |
   | Number of Functions     | 1851  |
   | Number of Header Files  | 310   |
   | Number of Classes       | 0     |
   | Number of C++ Files     | 0     |
   | Number of Lines Of Code | 45606 |
   | Self-Containedness      | 100%  |

   Data to external API (truncated to fit):

   ==> /cpp-queries/Security/CWE/CWE-020/CountUntrustedDataToExternalAPI.bqrs <==
   | ID of externalApi |            externalApi            | numberOfUses | numberOfUntrustedSources |
   |-------------------|-----------------------------------|--------------|--------------------------|
   |                 1 | read [param 1]                    |            4 |                        4 |
   |                 2 | read [param 2]                    |            4 |                        4 |
   |                 4 | __builtin___memmove_chk [param 2] |            1 |                        1 |
   |                 0 | fwrite [param 2]                  |            1 |                        1 |
   |                 3 | poll [param 2]                    |            1 |                        1 |

   ==> /cpp-queries/Security/CWE/CWE-020/IRCountUntrustedDataToExternalAPI.bqrs <==
   | ID of externalApi |            externalApi            | numberOfUses | numberOfUntrustedSources |
   |-------------------|-----------------------------------|--------------|--------------------------|
   |                 9 | read [param 1]                    |           12 |                        6 |
   |                 7 | free [param 0]                    |           27 |                        5 |
   |                16 | poll [param 2]                    |            3 |                        3 |
   |                12 | __builtin_object_size [param 0]   |            2 |                        2 |

   Hub classes (truncated to fit):
   ==> /cpp-queries/Architecture/General Class-Level Information/HubClasses.bqrs <==
   | ID of Class |                    Class                    |                                                                            URL for Class                                                                            | AfferentCoupling | EfferentCoupling |
   |-------------|---------------------------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------|------------------|------------------|
   |       39174 | in_addr                                     | file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/netinet/in.h:301:8:301:14                  |                8 |                0 |
   |       15020 | __darwin_fp_status                          | file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:150:1:150:17          |                6 |                0 |
   |       15007 | __darwin_xmm_reg                            | file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:213:1:213:15          |                6 |                0 |
   |       15013 | __darwin_mmst_reg                           | file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:194:1:194:16          |                6 |                0 |
   |       15042 | __darwin_fp_control                         | file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:92:1:92:18            |                6 |                0 |


