non-sarif-metadata/README.html

<div id="outline-container-org51382e8" class="outline-3">
<h3 id="org51382e8"><span class="section-number-3">4.2</span> Table queries</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Generating table output is more involved; the following produces CSV from all results.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Common variables</span>
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">PATH</span>=$<span style="color: #a0522d;">HOME</span>/local/codeql-v2.8.4/codeql:<span style="color: #8b2252;">"$PATH"</span>
<span style="color: #a0522d;">GITREV</span>=$(<span style="color: #ff00ff;">cd</span> ~/local/sarif-cli/non-sarif-metadata/pure-ftpd &amp;&amp; git rev-parse --short HEAD)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Working directory</span>
<span style="color: #483d8b;">cd</span> ~/local/sarif-cli/non-sarif-metadata/

<span style="color: #b22222;"># </span><span style="color: #b22222;">Remove prior files</span>
find pure-ftpd -name <span style="color: #8b2252;">"*.bqrs"</span> -exec rm {} <span style="color: #8b2252;">\;</span> 

<span style="color: #b22222;"># </span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Run a query against the database, saving the results to the results/</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">subdirectory of the database directory for further processing.</span>
codeql database run-queries -j8 --ram=20000 -- <span style="color: #8b2252;">\</span>
       pure-ftpd/pure-ftpd-$<span style="color: #a0522d;">GITREV</span>.db  tables.qls

find pure-ftpd -name <span style="color: #8b2252;">"*.bqrs"</span> &gt; bqrs-files

codeql resolve queries tables.qls  | <span style="color: #8b2252;">\</span>
    <span style="color: #a020f0;">while </span><span style="color: #483d8b;">read</span> path ; <span style="color: #a020f0;">do</span> basename <span style="color: #8b2252;">"$path"</span> ; <span style="color: #a020f0;">done</span> &gt; table-filenames

<span style="color: #b22222;"># </span><span style="color: #b22222;">Get general info about available results</span>
cat bqrs-files | <span style="color: #a020f0;">while </span><span style="color: #483d8b;">read</span> file 
<span style="color: #a020f0;">do</span>
    codeql bqrs info --format=text -- <span style="color: #8b2252;">"$file"</span>
<span style="color: #a020f0;">done</span> 

<span style="color: #b22222;"># </span><span style="color: #b22222;">Format result as csv for processing</span>
codeql bqrs decode  --result-set=<span style="color: #8b2252;">"#select"</span> <span style="color: #8b2252;">\</span>
       --format=csv <span style="color: #8b2252;">\</span>
       --entities=all -- <span style="color: #8b2252;">"$file"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Format results as text for reading</span>
cat bqrs-files | <span style="color: #a020f0;">while </span><span style="color: #483d8b;">read</span> file
<span style="color: #a020f0;">do</span>
    <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"==&gt; $file &lt;=="</span>
    codeql bqrs decode  --result-set=<span style="color: #8b2252;">"#select"</span> <span style="color: #8b2252;">\</span>
           --format=text <span style="color: #8b2252;">\</span>
           --entities=all -- <span style="color: #8b2252;">"$file"</span> |<span style="color: #8b2252;">\</span>
        sed <span style="color: #8b2252;">'s/\+--/|--/g;'</span> | sed <span style="color: #8b2252;">'s/--\+/--|/g;'</span>
<span style="color: #a020f0;">done</span>

</pre>
</div>

<p>
Repository-level results:
</p>

<p>
<code>=&gt; /cpp-queries/Metrics/Internal/DiagnosticsSumElapsedTimes.bqrs &lt;=</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">sum_frontend_elapsed_seconds</th>
<th scope="col" class="org-right">sum_extractor_elapsed_seconds</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">6.0</td>
<td class="org-right">4.0</td>
</tr>
</tbody>
</table>

<p>
<code>=&gt; /cpp-queries/Architecture/General Top-Level Information/GeneralStatistics.bqrs &lt;=</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-right">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Number of Files</td>
<td class="org-right">363</td>
</tr>

<tr>
<td class="org-left">Number of Unions</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">Number of C Files</td>
<td class="org-right">53</td>
</tr>

<tr>
<td class="org-left">Number of Structs</td>
<td class="org-right">235</td>
</tr>

<tr>
<td class="org-left">Number of Namespaces</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">Number of Functions</td>
<td class="org-right">1851</td>
</tr>

<tr>
<td class="org-left">Number of Header Files</td>
<td class="org-right">310</td>
</tr>

<tr>
<td class="org-left">Number of Classes</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Number of C++ Files</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Number of Lines Of Code</td>
<td class="org-right">45606</td>
</tr>

<tr>
<td class="org-left">Self-Containedness</td>
<td class="org-right">100%</td>
</tr>
</tbody>
</table>

<p>
Data to external API (truncated to fit):
</p>

<p>
<code>=&gt; /cpp-queries/Security/CWE/CWE-020/CountUntrustedDataToExternalAPI.bqrs &lt;=</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">ID of externalApi</th>
<th scope="col" class="org-left">externalApi</th>
<th scope="col" class="org-right">numberOfUses</th>
<th scope="col" class="org-right">numberOfUntrustedSources</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">read [param 1]</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">read [param 2]</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">__builtin___memmove_chk [param 2]</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-left">fwrite [param 2]</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">poll [param 2]</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<p>
<code>=&gt; /cpp-queries/Security/CWE/CWE-020/IRCountUntrustedDataToExternalAPI.bqrs &lt;=</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">ID of externalApi</th>
<th scope="col" class="org-left">externalApi</th>
<th scope="col" class="org-right">numberOfUses</th>
<th scope="col" class="org-right">numberOfUntrustedSources</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">9</td>
<td class="org-left">read [param 1]</td>
<td class="org-right">12</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">free [param 0]</td>
<td class="org-right">27</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">poll [param 2]</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">__builtin_object_size [param 0]</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>

<p>
Hub classes (truncated to fit):
<code>=&gt; /cpp-queries/Architecture/General Class-Level Information/HubClasses.bqrs &lt;=</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">ID of Class</th>
<th scope="col" class="org-left">Class</th>
<th scope="col" class="org-left">URL for Class</th>
<th scope="col" class="org-right">AfferentCoupling</th>
<th scope="col" class="org-right">EfferentCoupling</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">39174</td>
<td class="org-left">in_addr</td>
<td class="org-left"><a href="file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/netinet/in.h:301:8:301:14">file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/netinet/in.h:301:8:301:14</a></td>
<td class="org-right">8</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">15020</td>
<td class="org-left">__darwin_fp_status</td>
<td class="org-left"><a href="file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:150:1:150:17">file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:150:1:150:17</a></td>
<td class="org-right">6</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">15007</td>
<td class="org-left">__darwin_xmm_reg</td>
<td class="org-left"><a href="file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:213:1:213:15">file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:213:1:213:15</a></td>
<td class="org-right">6</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">15013</td>
<td class="org-left">__darwin_mmst_reg</td>
<td class="org-left"><a href="file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:194:1:194:16">file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:194:1:194:16</a></td>
<td class="org-right">6</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">15042</td>
<td class="org-left">__darwin_fp_control</td>
<td class="org-left"><a href="file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:92:1:92:18">file:///Applications/Xcode-11.4.1.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/mach/i386/_structs.h:92:1:92:18</a></td>
<td class="org-right">6</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>
</div>
</div>
