non-sarif-metadata/README.org
** Treemap queries
   The treemap queries are a large collection of code metrics intended for display
   as a treemap; the queries themselves produce table output.  These metrics are
   not further explored here, but listed for completeness:
   #+BEGIN_SRC sh
     hohn@gh-hohn ~/local/codeql-v2.8.4/ql/cpp/ql/src
     0:$ ag -l 'kind treemap'
     Metrics/Classes/CLackOfCohesionHS.ql
     Metrics/Classes/CHalsteadVocabulary.ql
     Metrics/Classes/CNumberOfFunctions.ql
     Metrics/Classes/CHalsteadLength.ql
     Metrics/Classes/CPercentageOfComplexCode.ql
     Metrics/Classes/CSizeOfAPI.ql
     Metrics/Classes/CLinesOfCode.ql
     Metrics/Classes/CAfferentCoupling.ql
     Metrics/Classes/CEfferentCoupling.ql
     Metrics/Classes/CHalsteadVolume.ql
     Metrics/Classes/CHalsteadEffort.ql
     Metrics/Classes/CResponse.ql
     Metrics/Classes/CHalsteadDifficulty.ql
     Metrics/Classes/CHalsteadBugs.ql
     Metrics/Classes/CInheritanceDepth.ql
     Metrics/Classes/CNumberOfStatements.ql
     Metrics/Classes/CSpecialisation.ql
     Metrics/Classes/CLackOfCohesionCK.ql
     Metrics/Classes/CNumberOfFields.ql
     Metrics/Dependencies/ExternalDependencies.ql
     Metrics/Files/FLinesOfCommentedOutCode.ql
     Metrics/Files/NumberOfParameters.ql
     Metrics/Files/FHalsteadLength.ql
     Metrics/Files/FLines.ql
     Metrics/Files/FHalsteadVocabulary.ql
     Metrics/Files/FCommentRatio.ql
     Metrics/Files/FTransitiveIncludes.ql
     Metrics/Files/AutogeneratedLOC.ql
     Metrics/Files/FLinesOfCode.ql
     Metrics/Files/FNumberOfClasses.ql
     Metrics/Files/NumberOfGlobals.ql
     Metrics/Files/NumberOfPublicGlobals.ql
     Metrics/Files/FNumberOfTests.ql
     Metrics/Files/FTimeInFrontend.ql
     Metrics/Files/FTodoComments.ql
     Metrics/Files/FCyclomaticComplexity.ql
     Metrics/Files/NumberOfFunctions.ql
     Metrics/Files/FTransitiveSourceIncludes.ql
     Metrics/Files/FHalsteadDifficulty.ql
     Metrics/Files/FHalsteadBugs.ql
     Metrics/Files/FLinesOfComments.ql
     Metrics/Files/ConditionalSegmentLines.ql
     Metrics/Files/FMacroRatio.ql
     Metrics/Files/ConditionalSegmentConditions.ql
     Metrics/Files/FHalsteadEffort.ql
     Metrics/Files/FAfferentCoupling.ql
     Metrics/Files/FHalsteadVolume.ql
     Metrics/Files/FDirectIncludes.ql
     Metrics/Files/NumberOfPublicFunctions.ql
     Metrics/Files/FEfferentCoupling.ql
     Metrics/Files/FunctionLength.ql
     Metrics/Functions/FunCyclomaticComplexity.ql
     Metrics/Functions/StatementNestingDepth.ql
     Metrics/Functions/FunLinesOfCode.ql
     Metrics/Functions/FunNumberOfCalls.ql
     Metrics/Functions/FunPercentageOfComments.ql
     Metrics/Functions/FunNumberOfStatements.ql
     Metrics/Functions/FunIterationNestingDepth.ql
     Metrics/Functions/FunNumberOfParameters.ql
     Metrics/Functions/FunLinesOfComments.ql

   #+END_SRC

** Custom queries  
   This script and the =metrics01.ql= files serve as starting point for custom
   metric / diagnostic queries using the CodeQL =File=, =Compilation=, or
   =Diagnostic= classes.
   #+BEGIN_SRC sh
     # Common variables
     export PATH=$HOME/local/codeql-v2.8.4/codeql:"$PATH"
     GITREV=$(cd ~/local/sarif-cli/non-sarif-metadata/pure-ftpd && git rev-parse --short HEAD)

     # Working directory
     cd ~/local/sarif-cli/non-sarif-metadata/

     # Run the custom query
     codeql database analyze --format=sarif-latest \
            --output metrics01.sarif                         \
            -j8                                              \
            --                                               \
            pure-ftpd/pure-ftpd-$GITREV.db                   \
            metrics01.ql

   #+END_SRC

   with log output:

   /Analysis produced the following diagnostic data:/
     | Diagnostic | Summary |
     |------------+----------+
     | metrics01  | 1 result |

#+HTML: </div> 
