non-sarif-metadata/README.html


<div id="outline-container-orgd05c2f8" class="outline-3">
<h3 id="orgd05c2f8"><span class="section-number-3">4.3</span> Treemap queries</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The treemap queries are a large collection of code metrics intended for display
as a treemap; the queries themselves produce table output.  These metrics are
not further explored here, but listed for completeness:
</p>
<div class="org-src-container">
<pre class="src src-sh">hohn@gh-hohn ~/local/codeql-v2.8.4/ql/cpp/ql/src
0:$ ag -l <span style="color: #8b2252;">'kind treemap'</span>
Metrics/Classes/CLackOfCohesionHS.ql
Metrics/Classes/CHalsteadVocabulary.ql
Metrics/Classes/CNumberOfFunctions.ql
Metrics/Classes/CHalsteadLength.ql
Metrics/Classes/CPercentageOfComplexCode.ql
Metrics/Classes/CSizeOfAPI.ql
Metrics/Classes/CLinesOfCode.ql
Metrics/Classes/CAfferentCoupling.ql
Metrics/Classes/CEfferentCoupling.ql
Metrics/Classes/CHalsteadVolume.ql
Metrics/Classes/CHalsteadEffort.ql
Metrics/Classes/CResponse.ql
Metrics/Classes/CHalsteadDifficulty.ql
Metrics/Classes/CHalsteadBugs.ql
Metrics/Classes/CInheritanceDepth.ql
Metrics/Classes/CNumberOfStatements.ql
Metrics/Classes/CSpecialisation.ql
Metrics/Classes/CLackOfCohesionCK.ql
Metrics/Classes/CNumberOfFields.ql
Metrics/Dependencies/ExternalDependencies.ql
Metrics/Files/FLinesOfCommentedOutCode.ql
Metrics/Files/NumberOfParameters.ql
Metrics/Files/FHalsteadLength.ql
Metrics/Files/FLines.ql
Metrics/Files/FHalsteadVocabulary.ql
Metrics/Files/FCommentRatio.ql
Metrics/Files/FTransitiveIncludes.ql
Metrics/Files/AutogeneratedLOC.ql
Metrics/Files/FLinesOfCode.ql
Metrics/Files/FNumberOfClasses.ql
Metrics/Files/NumberOfGlobals.ql
Metrics/Files/NumberOfPublicGlobals.ql
Metrics/Files/FNumberOfTests.ql
Metrics/Files/FTimeInFrontend.ql
Metrics/Files/FTodoComments.ql
Metrics/Files/FCyclomaticComplexity.ql
Metrics/Files/NumberOfFunctions.ql
Metrics/Files/FTransitiveSourceIncludes.ql
Metrics/Files/FHalsteadDifficulty.ql
Metrics/Files/FHalsteadBugs.ql
Metrics/Files/FLinesOfComments.ql
Metrics/Files/ConditionalSegmentLines.ql
Metrics/Files/FMacroRatio.ql
Metrics/Files/ConditionalSegmentConditions.ql
Metrics/Files/FHalsteadEffort.ql
Metrics/Files/FAfferentCoupling.ql
Metrics/Files/FHalsteadVolume.ql
Metrics/Files/FDirectIncludes.ql
Metrics/Files/NumberOfPublicFunctions.ql
Metrics/Files/FEfferentCoupling.ql
Metrics/Files/FunctionLength.ql
Metrics/Functions/FunCyclomaticComplexity.ql
Metrics/Functions/StatementNestingDepth.ql
Metrics/Functions/FunLinesOfCode.ql
Metrics/Functions/FunNumberOfCalls.ql
Metrics/Functions/FunPercentageOfComments.ql
Metrics/Functions/FunNumberOfStatements.ql
Metrics/Functions/FunIterationNestingDepth.ql
Metrics/Functions/FunNumberOfParameters.ql
Metrics/Functions/FunLinesOfComments.ql

</pre>
</div>
</div>
</div>

<div id="outline-container-org59c972a" class="outline-3">
<h3 id="org59c972a"><span class="section-number-3">4.4</span> Custom queries</h3>
<div class="outline-text-3" id="text-4-4">
<p>
This script and the <code>metrics01.ql</code> files serve as starting point for custom
metric / diagnostic queries using the CodeQL <code>File</code>, <code>Compilation</code>, or
<code>Diagnostic</code> classes.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">Common variables</span>
<span style="color: #483d8b;">export</span> <span style="color: #a0522d;">PATH</span>=$<span style="color: #a0522d;">HOME</span>/local/codeql-v2.8.4/codeql:<span style="color: #8b2252;">"$PATH"</span>
<span style="color: #a0522d;">GITREV</span>=$(<span style="color: #ff00ff;">cd</span> ~/local/sarif-cli/non-sarif-metadata/pure-ftpd &amp;&amp; git rev-parse --short HEAD)

<span style="color: #b22222;"># </span><span style="color: #b22222;">Working directory</span>
<span style="color: #483d8b;">cd</span> ~/local/sarif-cli/non-sarif-metadata/

<span style="color: #b22222;"># </span><span style="color: #b22222;">Run the custom query</span>
codeql database analyze --format=sarif-latest <span style="color: #8b2252;">\</span>
       --output metrics01.sarif                         <span style="color: #8b2252;">\</span>
       -j8                                              <span style="color: #8b2252;">\</span>
       --                                               <span style="color: #8b2252;">\</span>
       pure-ftpd/pure-ftpd-$<span style="color: #a0522d;">GITREV</span>.db                   <span style="color: #8b2252;">\</span>
       metrics01.ql

</pre>
</div>

<p>
with log output:
</p>

<p>
<i>Analysis produced the following diagnostic data:</i>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Diagnostic</th>
<th scope="col" class="org-left">Summary</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">metrics01</td>
<td class="org-left">1 result</td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Michael Hohn</p>
<p class="date">Created: 2022-04-28 Thu 16:09</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
